iSYSTEMLabs/winIDEAExampleWorkspaces/TI/MSP432E401Y/emptyTargetInit/startupM.c
#include "MSP432.h"

extern int main(void);
extern void InterruptRoutine();
extern void InitClocks();

extern unsigned long _estack;

extern unsigned long _etext;
extern unsigned long _data;
extern unsigned long _edata;
extern unsigned long _bss;
extern unsigned long _ebss;

__attribute__ ((naked))
void Reset()
{
  __asm__("ldr sp,=_estack");
  
  volatile unsigned long *pulSrc = &_etext;
  volatile unsigned long *pulDest = &_data;
  
  while( pulDest < &_edata )
  {
    *pulDest++ = *pulSrc++;
  }
  
  pulDest = &_bss;
  while ( pulDest < &_ebss )
  {
    *pulDest++ = 0;
  }
  
  
  main();
}

void IntDefaultHandler()
{
  while(1)
  {
  }
}

void HardFaulHandler()
{
  while(1)
  {
  }
}

void NMIHandler()
{
  while(1)
  {
  }
}

void TimerInterruptHandler()
{
  TIMER0CTL &= ~(1 << TAEN);
  TIMER0ICR |= (1 << TATOCINT);
  InterruptRoutine();
  TIMER0CTL |= (1 << TAEN);
}

typedef void (*pfnISR)(void);

__attribute__ ((section(".isr_vector")))
struct SISRType
{
  union
  {
    pfnISR        m_pfnISR;
    unsigned long m_dword;
  };
}g_ISRTable[] =
{
  (void *)& _estack,     // Initial stack pointer                            
  Reset,                        // Reset handler
  NMIHandler,            // NMI handler
  HardFaulHandler,            // Hard fault handler
  IntDefaultHandler,            // MPU fault handler
  IntDefaultHandler,            // Bus fault handler
  IntDefaultHandler,            // Usage fault handler
  0,                            // Reserved
  0,                            // Reserved
  0,                            // Reserved
  0,                            // Reserved
  IntDefaultHandler,            // SVCall handler
  IntDefaultHandler,            // Debug monitor handler
  0,                            // Reserved
  IntDefaultHandler,            // PendSV handler
  IntDefaultHandler,            // SysTick handler
  IntDefaultHandler,
  IntDefaultHandler,
  IntDefaultHandler,
  IntDefaultHandler,
  IntDefaultHandler,
  IntDefaultHandler,
  IntDefaultHandler,
  IntDefaultHandler,
  IntDefaultHandler,
  IntDefaultHandler,
  IntDefaultHandler,
  IntDefaultHandler,
  IntDefaultHandler,
  IntDefaultHandler,
  IntDefaultHandler,
  IntDefaultHandler,
  IntDefaultHandler,
  IntDefaultHandler,
  IntDefaultHandler,
  TimerInterruptHandler, // IRQ19
  IntDefaultHandler,
  IntDefaultHandler
};

